Revit 2025 API
EnergyAnalysisSurfaceType Enumeration
 Analytical surface types.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum EnergyAnalysisSurfaceType
Public Enumeration EnergyAnalysisSurfaceType
public enum class EnergyAnalysisSurfaceType
type EnergyAnalysisSurfaceType
Members
Member name | Value | Description
Roof | 0 |  Roof.
ExteriorWall | 1 |  Exterior wall.
InteriorWall | 2 |  Interior wall.
Ceiling | 3 |  Ceiling.
InteriorFloor | 4 |  Interior floor.
ExteriorFloor | 5 |  Exterior floor.
Shading | 6 |  Shading.
Air | 7 |  Air.
Underground | 8 |  Underground
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace